rizinorg/rizin/librz/asm/arch/rl78/rl78_maps.c
// SPDX-FileCopyrightText: 2023 Bastian Engel <bastian.engel00@gmail.com>
// SPDX-License-Identifier: LGPL-3.0-only

#include "rl78_maps.h"

/*
 * The 'User's Manual: Software' for the RL78 Family arranges instructions in
 * four instruction maps, each indexed by an unsigned byte. Thus, the entry at
 * index [0xXYZ] corresponds to entry YZ of instruction map (X + 1). Empty
 * positions are left out
 */

RL78Instr rl78_instr_maps[4 * 256] = {
        // map 0
        // 0x000-0x0f
        [0x000] = { .operation = RL78_OPERATION_NOP },
        [0x001] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_ADDW },
        [0x002] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_ADDW },
        [0x003] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    .operation = RL78_OPERATION_ADDW },
        [0x004] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_IMMEDIATE_16 },
                    .operation = RL78_OPERATION_ADDW },
        [0x005] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_DE },
                    .operation = RL78_OPERATION_ADDW },
        [0x006] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_ADDW },
        [0x007] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_ADDW },
        [0x008] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    .operation = RL78_OPERATION_XCH },
        [0x009] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_ADDR_16, .v0 = RL78_GPR_B },
                    .operation = RL78_OPERATION_MOV },
        [0x00A] = { { .type = RL78_OP_TYPE_SADDR },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_ADD },
        [0x00B] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_ADD },
        [0x00C] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8,},
                    .operation = RL78_OPERATION_ADD },
        [0x00D] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_ADD },
        [0x00E] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_ADD },
        [0x00F] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_ADD },

        // 0x010-0x01f
        [0x010] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_CR_SP },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_ADDW },
        [0x012] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_MOVW },
        [0x013] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    .operation = RL78_OPERATION_MOVW },
        [0x014] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_DE },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_MOVW },
        [0x015] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_DE },
                    .operation = RL78_OPERATION_MOVW },
        [0x016] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_HL },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_MOVW },
        [0x017] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_MOVW },
        [0x018] = { { .type = RL78_OP_TYPE_BASED_ADDR_16, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_MOV },
        [0x019] = { { .type = RL78_OP_TYPE_BASED_ADDR_16, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_MOV },
        [0x01A] = { { .type = RL78_OP_TYPE_SADDR },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_ADDC },
        [0x01B] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_ADDC },
        [0x01C] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8,},
                    .operation = RL78_OPERATION_ADDC },
        [0x01D] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_ADDC },
        [0x01E] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_ADDC },
        [0x01F] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_ADDC },

