rizinorg/rizin/librz/asm/arch/rl78/rl78_maps.c
        // 0x020-0x02f
        [0x020] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_CR_SP },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_SUBW },
        [0x022] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_SUBW },
        [0x023] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    .operation = RL78_OPERATION_SUBW },
        [0x024] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_IMMEDIATE_16 },
                    .operation = RL78_OPERATION_SUBW },
        [0x025] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_DE },
                    .operation = RL78_OPERATION_SUBW },
        [0x026] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_SUBW },
        [0x027] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_SUBW },
        [0x028] = { { .type = RL78_OP_TYPE_BASED_ADDR_16, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_MOV },
        [0x029] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_ADDR_16, .v0 = RL78_GPR_C },
                    .operation = RL78_OPERATION_MOV },
        [0x02A] = { { .type = RL78_OP_TYPE_SADDR },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_SUB },
        [0x02B] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_SUB },
        [0x02C] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8,},
                    .operation = RL78_OPERATION_SUB },
        [0x02D] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_SUB },
        [0x02E] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_SUB },
        [0x02F] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_SUB },

        // 0x030-0x03f
        [0x030] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_IMMEDIATE_16 },
                    .operation = RL78_OPERATION_MOVW },
        [0x032] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_IMMEDIATE_16 },
                    .operation = RL78_OPERATION_MOVW },
        [0x033] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    .operation = RL78_OPERATION_XCHW },
        [0x034] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_DE },
                    { .type = RL78_OP_TYPE_IMMEDIATE_16 },
                    .operation = RL78_OPERATION_MOVW },
        [0x035] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_DE },
                    .operation = RL78_OPERATION_XCHW },
        [0x036] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_HL },
                    { .type = RL78_OP_TYPE_IMMEDIATE_16 },
                    .operation = RL78_OPERATION_MOVW },
        [0x037] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_XCHW },
        [0x038] = { { .type = RL78_OP_TYPE_BASED_ADDR_16, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_MOV },
        [0x039] = { { .type = RL78_OP_TYPE_BASED_ADDR_16, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_MOV },
        [0x03A] = { { .type = RL78_OP_TYPE_SADDR },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_SUBC },
        [0x03B] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_SUBC },
        [0x03C] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8,},
                    .operation = RL78_OPERATION_SUBC },
        [0x03D] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_SUBC },
        [0x03E] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_SUBC },
        [0x03F] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_SUBC },

        // 0x040-0x04f
        [0x040] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_CMP },
        [0x041] = { { .type = RL78_OP_TYPE_SFR, .v0 = RL78_SFR_ES },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_MOV },
        [0x042] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_CMPW },
        [0x043] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    .operation = RL78_OPERATION_CMPW },
        [0x044] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_IMMEDIATE_16 },
                    .operation = RL78_OPERATION_CMPW },
        [0x045] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_DE },
                    .operation = RL78_OPERATION_CMPW },
        [0x046] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_CMPW },
        [0x047] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_CMPW },
        [0x048] = { { .type = RL78_OP_TYPE_BASED_ADDR_16, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_MOV },
        [0x049] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_ADDR_16, .v0 = RL78_GPR_BC },
                    .operation = RL78_OPERATION_MOV },
        [0x04A] = { { .type = RL78_OP_TYPE_SADDR },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_CMP },
        [0x04B] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_CMP },
        [0x04C] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8,},
                    .operation = RL78_OPERATION_CMP },
        [0x04D] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_CMP },
        [0x04E] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_CMP },
        [0x04F] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                        { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                         .operation = RL78_OPERATION_CMP },

        // 0x050-0x05f
        [0x050] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_MOV },
        [0x051] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_MOV },
        [0x052] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_MOV },
        [0x053] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_MOV },
        [0x054] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_MOV },
        [0x055] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_MOV },
        [0x056] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_MOV },
        [0x057] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_MOV },
        [0x058] = { { .type = RL78_OP_TYPE_BASED_ADDR_16, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_MOVW },
        [0x059] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_BASED_ADDR_16, .v0 = RL78_GPR_B },
                    .operation = RL78_OPERATION_MOVW },
        [0x05A] = { { .type = RL78_OP_TYPE_SADDR },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_AND },
        [0x05B] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_AND },
        [0x05C] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8,},
                    .operation = RL78_OPERATION_AND },
        [0x05D] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_AND },
        [0x05E] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_AND },
        [0x05F] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                        { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                         .operation = RL78_OPERATION_AND },

        // 0x060-0x06f
        [0x060] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    .operation = RL78_OPERATION_MOV },
        [0x062] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    .operation = RL78_OPERATION_MOV },
        [0x063] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    .operation = RL78_OPERATION_MOV },
        [0x064] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    .operation = RL78_OPERATION_MOV },
        [0x065] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    .operation = RL78_OPERATION_MOV },
        [0x066] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    .operation = RL78_OPERATION_MOV },
        [0x067] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    .operation = RL78_OPERATION_MOV },
        [0x068] = { { .type = RL78_OP_TYPE_BASED_ADDR_16, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_MOVW },
        [0x069] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_BASED_ADDR_16, .v0 = RL78_GPR_C },
                    .operation = RL78_OPERATION_MOVW },
        [0x06A] = { { .type = RL78_OP_TYPE_SADDR },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_OR },
        [0x06B] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_OR },
        [0x06C] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8,},
                    .operation = RL78_OPERATION_OR },
        [0x06D] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_OR },
        [0x06E] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_OR },
        [0x06F] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_OR },

        // 0x070-0x07f
        [0x070] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_MOV },
        [0x072] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_MOV },
        [0x073] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_MOV },
        [0x074] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_MOV },
        [0x075] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_MOV },
        [0x076] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_MOV },
        [0x077] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_MOV },
        [0x078] = { { .type = RL78_OP_TYPE_BASED_ADDR_16, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_MOVW },
        [0x079] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_BASED_ADDR_16, .v0 = RL78_GPR_BC },
                    .operation = RL78_OPERATION_MOVW },
        [0x07A] = { { .type = RL78_OP_TYPE_SADDR },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_XOR },
        [0x07B] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_XOR },
        [0x07C] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8,},
                    .operation = RL78_OPERATION_XOR },
        [0x07D] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_XOR },
        [0x07E] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_XOR },
        [0x07F] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_XOR },

        // 0x080-0x08f
        [0x080] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    .operation = RL78_OPERATION_INC },
        [0x081] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_INC },
        [0x082] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    .operation = RL78_OPERATION_INC },
        [0x083] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    .operation = RL78_OPERATION_INC },
        [0x084] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    .operation = RL78_OPERATION_INC },
        [0x085] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    .operation = RL78_OPERATION_INC },
        [0x086] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    .operation = RL78_OPERATION_INC },
        [0x087] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    .operation = RL78_OPERATION_INC },
        [0x088] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_CR_SP },
                    .operation = RL78_OPERATION_MOV },
        [0x089] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = RL78_GPR_DE },
                    .operation = RL78_OPERATION_MOV },
        [0x08A] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_DE },
                    .operation = RL78_OPERATION_MOV },
        [0x08B] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_MOV },
        [0x08C] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_MOV },
        [0x08D] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_MOV },
        [0x08E] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SFR },
                    .operation = RL78_OPERATION_MOV },
        [0x08F] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_MOV },

        // 0x090-0x09f
        [0x090] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    .operation = RL78_OPERATION_DEC },
        [0x091] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_DEC },
        [0x092] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    .operation = RL78_OPERATION_DEC },
        [0x093] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    .operation = RL78_OPERATION_DEC },
        [0x094] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    .operation = RL78_OPERATION_DEC },
        [0x095] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    .operation = RL78_OPERATION_DEC },
        [0x096] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    .operation = RL78_OPERATION_DEC },
        [0x097] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    .operation = RL78_OPERATION_DEC },
        [0x098] = { { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_CR_SP },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_MOV },
        [0x099] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = RL78_GPR_DE },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_MOV },
        [0x09A] = { { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_DE },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_MOV },
        [0x09B] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = RL78_GPR_HL },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_MOV },
        [0x09C] = { { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_MOV },
        [0x09D] = { { .type = RL78_OP_TYPE_SADDR },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_MOV },
        [0x09E] = { { .type = RL78_OP_TYPE_SFR },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_MOV },
        [0x09F] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_MOV },

