rizinorg/rizin/librz/asm/arch/rl78/rl78_maps.c
        // 0x0A0-0x0af
        [0x0A0] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_INC },
        [0x0A1] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_INCW },
        [0x0A2] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_INCW },
        [0x0A3] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    .operation = RL78_OPERATION_INCW },
        [0x0A4] = { { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_INC },
        [0x0A5] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_DE },
                    .operation = RL78_OPERATION_INCW },
        [0x0A6] = { { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_INCW },
        [0x0A7] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_INCW },
        [0x0A8] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_CR_SP },
                    .operation = RL78_OPERATION_MOVW },
        [0x0A9] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = RL78_GPR_DE },
                    .operation = RL78_OPERATION_MOVW },
        [0x0AA] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_DE },
                    .operation = RL78_OPERATION_MOVW },
        [0x0AB] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_MOVW },
        [0x0AC] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_MOVW },
        [0x0AD] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_MOVW },
        [0x0AE] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_SFR },
                    .operation = RL78_OPERATION_MOVW },
        [0x0AF] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_MOVW },

        // 0x0B0-0x0bf
        [0x0B0] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_DEC },
        [0x0B1] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_DECW },
        [0x0B2] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_DECW },
        [0x0B3] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    .operation = RL78_OPERATION_DECW },
        [0x0B4] = { { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_DEC },
        [0x0B5] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_DE },
                    .operation = RL78_OPERATION_DECW },
        [0x0B6] = { { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_DECW },
        [0x0B7] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_DECW },
        [0x0B8] = { { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_CR_SP },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_MOVW },
        [0x0B9] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = RL78_GPR_DE },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_MOVW },
        [0x0BA] = { { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_DE },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_MOVW },
        [0x0BB] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = RL78_GPR_HL },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_MOVW },
        [0x0BC] = { { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_MOVW },
        [0x0BD] = { { .type = RL78_OP_TYPE_SADDR },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_MOVW },
        [0x0BE] = { { .type = RL78_OP_TYPE_SFR },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_MOVW },
        [0x0BF] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_MOVW },

        // 0x0C0-0x0cf
        [0x0C0] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_POP },
        [0x0C1] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_PUSH },
        [0x0C2] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    .operation = RL78_OPERATION_POP },
        [0x0C3] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    .operation = RL78_OPERATION_PUSH },
        [0x0C4] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_DE },
                    .operation = RL78_OPERATION_POP },
        [0x0C5] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_DE },
                    .operation = RL78_OPERATION_PUSH },
        [0x0C6] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_POP },
        [0x0C7] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_PUSH },
        [0x0C8] = { { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_CR_SP },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_MOV },
        [0x0C9] = { { .type = RL78_OP_TYPE_SADDR },
                    { .type = RL78_OP_TYPE_IMMEDIATE_16 },
                    .operation = RL78_OPERATION_MOVW },
        [0x0CA] = { { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_DE },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_MOV },
        [0x0CB] = { { .type = RL78_OP_TYPE_SFR },
                    { .type = RL78_OP_TYPE_IMMEDIATE_16 },
                    .operation = RL78_OPERATION_MOVW },
        [0x0CC] = { { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_MOV },
        [0x0CD] = { { .type = RL78_OP_TYPE_SADDR },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_MOV },
        [0x0CE] = { { .type = RL78_OP_TYPE_SFR },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_MOV },
        [0x0CF] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    { .type = RL78_OP_TYPE_IMMEDIATE_8 },
                    .operation = RL78_OPERATION_MOV },

        // 0X0D0-0x0df
        [0x0D0] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    .operation = RL78_OPERATION_CMP0 },
        [0x0D1] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_CMP0 },
        [0x0D2] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    .operation = RL78_OPERATION_CMP0 },
        [0x0D3] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    .operation = RL78_OPERATION_CMP0 },
        [0x0D4] = { { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_CMP0 },
        [0x0D5] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_CMP0 },
        [0x0D6] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    .operation = RL78_OPERATION_MULU },
        [0x0D7] = { .operation = RL78_OPERATION_RET },
        [0x0D8] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_MOV },
        [0x0D9] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_MOV },
        [0x0DA] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_MOVW },
        [0x0DB] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_MOVW },
        [0x0DC] = { { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BC },
        [0x0DD] = { { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BZ },
        [0x0DE] = { { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BNC },
        [0x0DF] = { { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BNZ },

        // 0X0E0-0x0ef
        [0x0E0] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    .operation = RL78_OPERATION_ONEB },
        [0x0E1] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_ONEB },
        [0x0E2] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    .operation = RL78_OPERATION_ONEB },
        [0x0E3] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    .operation = RL78_OPERATION_ONEB },
        [0x0E4] = { { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_ONEB },
        [0x0E5] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_ONEB },
        [0x0E6] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_ONEW },
        [0x0E7] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    .operation = RL78_OPERATION_ONEW },
        [0x0E8] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_MOV },
        [0x0E9] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_MOV },
        [0x0EA] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_DE },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_MOVW },
        [0x0EB] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_DE },
                    { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_MOVW },
        [0x0EC] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_20 },
                    .operation = RL78_OPERATION_BR },
        [0x0ED] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_BR },
        [0x0EE] = { { .type = RL78_OP_TYPE_RELATIVE_ADDR_16 },
                    .operation = RL78_OPERATION_BR },
        [0x0EF] = { { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BR },

        // 0X0F0-0x0ff
        [0x0F0] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    .operation = RL78_OPERATION_CLRB },
        [0x0F1] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_CLRB },
        [0x0F2] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    .operation = RL78_OPERATION_CLRB },
        [0x0F3] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    .operation = RL78_OPERATION_CLRB },
        [0x0F4] = { { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_CLRB },
        [0x0F5] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_CLRB },
        [0x0F6] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    .operation = RL78_OPERATION_CLRW },
        [0x0F7] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    .operation = RL78_OPERATION_CLRW },
        [0x0F8] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_MOV },
        [0x0F9] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_MOV },
        [0x0FA] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_HL },
                    { .type = RL78_OP_TYPE_SADDR },
                    .operation = RL78_OPERATION_MOVW },
        [0x0FB] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_HL },
                    { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_MOVW },
        [0x0FC] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_20 },
                    .operation = RL78_OPERATION_CALL },
        [0x0FD] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                    .operation = RL78_OPERATION_CALL },
        [0x0FE] = { { .type = RL78_OP_TYPE_RELATIVE_ADDR_16 },
                    .operation = RL78_OPERATION_CALL },

        // map 1
        // 0x100-0x10f
        [0x100] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_ADD },
        [0x101] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_ADD },
        [0x102] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_ADD },
        [0x103] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_ADD },
        [0x104] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_ADD },
        [0x105] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_ADD },
        [0x106] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_ADD },
        [0x107] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_ADD },
        [0x108] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    .operation = RL78_OPERATION_ADD },
        [0x109] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_ADDW },
        [0x10A] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    .operation = RL78_OPERATION_ADD },
        [0x10B] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    .operation = RL78_OPERATION_ADD },
        [0x10C] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    .operation = RL78_OPERATION_ADD },
        [0x10D] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    .operation = RL78_OPERATION_ADD },
        [0x10E] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    .operation = RL78_OPERATION_ADD },
        [0x10F] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    .operation = RL78_OPERATION_ADD },

