rizinorg/rizin/librz/asm/arch/rl78/rl78_maps.c
        // 0x110-0x11f
        [0x110] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_ADDC },
        [0x111] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_ADDC },
        [0x112] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_ADDC },
        [0x113] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_ADDC },
        [0x114] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_ADDC },
        [0x115] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_ADDC },
        [0x116] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_ADDC },
        [0x117] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_ADDC },
        [0x118] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    .operation = RL78_OPERATION_ADDC },
        [0x11A] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    .operation = RL78_OPERATION_ADDC },
        [0x11B] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    .operation = RL78_OPERATION_ADDC },
        [0x11C] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    .operation = RL78_OPERATION_ADDC },
        [0x11D] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    .operation = RL78_OPERATION_ADDC },
        [0x11E] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    .operation = RL78_OPERATION_ADDC },
        [0x11F] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    .operation = RL78_OPERATION_ADDC },

        // 0x120-0x12f
        [0x120] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_SUB },
        [0x121] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_SUB },
        [0x122] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_SUB },
        [0x123] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_SUB },
        [0x124] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_SUB },
        [0x125] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_SUB },
        [0x126] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_SUB },
        [0x127] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_SUB },
        [0x128] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    .operation = RL78_OPERATION_SUB },
        [0x129] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_SUBW },
        [0x12A] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    .operation = RL78_OPERATION_SUB },
        [0x12B] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    .operation = RL78_OPERATION_SUB },
        [0x12C] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    .operation = RL78_OPERATION_SUB },
        [0x12D] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    .operation = RL78_OPERATION_SUB },
        [0x12E] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    .operation = RL78_OPERATION_SUB },
        [0x12F] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    .operation = RL78_OPERATION_SUB },

        // 0x130-0x13f
        [0x130] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_SUBC },
        [0x131] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_SUBC },
        [0x132] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_SUBC },
        [0x133] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_SUBC },
        [0x134] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_SUBC },
        [0x135] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_SUBC },
        [0x136] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_SUBC },
        [0x137] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_SUBC },
        [0x138] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    .operation = RL78_OPERATION_SUBC },
        [0x13A] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    .operation = RL78_OPERATION_SUBC },
        [0x13B] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    .operation = RL78_OPERATION_SUBC },
        [0x13C] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    .operation = RL78_OPERATION_SUBC },
        [0x13D] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    .operation = RL78_OPERATION_SUBC },
        [0x13E] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    .operation = RL78_OPERATION_SUBC },
        [0x13F] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    .operation = RL78_OPERATION_SUBC },

        // 0x140-0x14f
        [0x140] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_CMP },
        [0x141] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_CMP },
        [0x142] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_CMP },
        [0x143] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_CMP },
        [0x144] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_CMP },
        [0x145] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_CMP },
        [0x146] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_CMP },
        [0x147] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_CMP },
        [0x148] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    .operation = RL78_OPERATION_CMP },
        [0x149] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_CMPW },
        [0x14A] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    .operation = RL78_OPERATION_CMP },
        [0x14B] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    .operation = RL78_OPERATION_CMP },
        [0x14C] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    .operation = RL78_OPERATION_CMP },
        [0x14D] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    .operation = RL78_OPERATION_CMP },
        [0x14E] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    .operation = RL78_OPERATION_CMP },
        [0x14F] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    .operation = RL78_OPERATION_CMP },

        // 0x150-0x15f
        [0x150] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_AND },
        [0x151] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_AND },
        [0x152] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_AND },
        [0x153] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_AND },
        [0x154] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_AND },
        [0x155] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_AND },
        [0x156] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_AND },
        [0x157] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_AND },
        [0x158] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    .operation = RL78_OPERATION_AND },
        [0x159] = { { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_INC },
        [0x15A] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    .operation = RL78_OPERATION_AND },
        [0x15B] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    .operation = RL78_OPERATION_AND },
        [0x15C] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    .operation = RL78_OPERATION_AND },
        [0x15D] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    .operation = RL78_OPERATION_AND },
        [0x15E] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    .operation = RL78_OPERATION_AND },
        [0x15F] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    .operation = RL78_OPERATION_AND },

        // 0x160-0x16f
        [0x160] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_OR },
        [0x161] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_OR },
        [0x162] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_OR },
        [0x163] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_OR },
        [0x164] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_OR },
        [0x165] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_OR },
        [0x166] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_OR },
        [0x167] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_OR },
        [0x168] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    .operation = RL78_OPERATION_OR },
        [0x169] = { { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_DEC },
        [0x16A] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    .operation = RL78_OPERATION_OR },
        [0x16B] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    .operation = RL78_OPERATION_OR },
        [0x16C] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    .operation = RL78_OPERATION_OR },
        [0x16D] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    .operation = RL78_OPERATION_OR },
        [0x16E] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    .operation = RL78_OPERATION_OR },
        [0x16F] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    .operation = RL78_OPERATION_OR },

        // 0x170-0x17f
        [0x170] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_XOR },
        [0x171] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_XOR },
        [0x172] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_XOR },
        [0x173] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_XOR },
        [0x174] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_XOR },
        [0x175] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_XOR },
        [0x176] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_XOR },
        [0x177] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    .operation = RL78_OPERATION_XOR },
        [0x178] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    .operation = RL78_OPERATION_XOR },
        [0x179] = { { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_INCW },
        [0x17A] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    .operation = RL78_OPERATION_XOR },
        [0x17B] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    .operation = RL78_OPERATION_XOR },
        [0x17C] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    .operation = RL78_OPERATION_XOR },
        [0x17D] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    .operation = RL78_OPERATION_XOR },
        [0x17E] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    .operation = RL78_OPERATION_XOR },
        [0x17F] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    .operation = RL78_OPERATION_XOR },

        // 0x180-0x18f
        [0x180] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_B },
                    .operation = RL78_OPERATION_ADD },
        [0x182] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_C },
                    .operation = RL78_OPERATION_ADD },
        [0x184] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x0080 },
                    .operation = RL78_OPERATION_CALLT },
        [0x185] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x0090 },
                    .operation = RL78_OPERATION_CALLT },
        [0x186] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x00A0 },
                    .operation = RL78_OPERATION_CALLT },
        [0x187] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x00B0 },
                    .operation = RL78_OPERATION_CALLT },
        [0x189] = { { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    .operation = RL78_OPERATION_DECW },
        [0x18A] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    .operation = RL78_OPERATION_XCH },
        [0x18B] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    .operation = RL78_OPERATION_XCH },
        [0x18C] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_E },
                    .operation = RL78_OPERATION_XCH },
        [0x18D] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_D },
                    .operation = RL78_OPERATION_XCH },
        [0x18E] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_L },
                    .operation = RL78_OPERATION_XCH },
        [0x18F] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_H },
                    .operation = RL78_OPERATION_XCH },

