rizinorg/rizin/librz/asm/arch/rl78/rl78_maps.c
        // 0x190-0x19f
        [0x190] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_B },
                    .operation = RL78_OPERATION_ADDC },
        [0x192] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_C },
                    .operation = RL78_OPERATION_ADDC },
        [0x194] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x0082 },
                    .operation = RL78_OPERATION_CALLT },
        [0x195] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x0092 },
                    .operation = RL78_OPERATION_CALLT },
        [0x196] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x00A2 },
                    .operation = RL78_OPERATION_CALLT },
        [0x197] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x00B2 },
                    .operation = RL78_OPERATION_CALLT },

        // 0x1a0-0x1af
        [0x1a0] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_B },
                    .operation = RL78_OPERATION_SUB },
        [0x1a2] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_C },
                    .operation = RL78_OPERATION_SUB },
        [0x1a4] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x0084 },
                    .operation = RL78_OPERATION_CALLT },
        [0x1a5] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x0094 },
                    .operation = RL78_OPERATION_CALLT },
        [0x1a6] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x00A4 },
                    .operation = RL78_OPERATION_CALLT },
        [0x1a7] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x00B4 },
                    .operation = RL78_OPERATION_CALLT },
        [0x1a8] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SADDR },
                     .operation = RL78_OPERATION_XCH },
        [0x1a9] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_C },
                     .operation = RL78_OPERATION_XCH },
        [0x1aa] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16 },
                     .operation = RL78_OPERATION_XCH },
        [0x1ab] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_SFR },
                     .operation = RL78_OPERATION_XCH },
        [0x1ac] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = RL78_GPR_HL },
                     .operation = RL78_OPERATION_XCH },
        [0x1ad] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                     .operation = RL78_OPERATION_XCH },
        [0x1ae] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = RL78_GPR_DE },
                     .operation = RL78_OPERATION_XCH },
        [0x1af] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_DE },
                     .operation = RL78_OPERATION_XCH },

        // 0x1b0-0x1bf
        [0x1b0] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_B },
                    .operation = RL78_OPERATION_SUBC },
        [0x1b2] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_C },
                    .operation = RL78_OPERATION_SUBC },
        [0x1b4] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x0086 },
                    .operation = RL78_OPERATION_CALLT },
        [0x1b5] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x0096 },
                    .operation = RL78_OPERATION_CALLT },
        [0x1b6] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x00A6 },
                    .operation = RL78_OPERATION_CALLT },
        [0x1b7] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x00B6 },
                    .operation = RL78_OPERATION_CALLT },
        [0x1b8] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_SFR_ES },
                    { .type = RL78_OP_TYPE_SADDR },
                     .operation = RL78_OPERATION_MOV },
        [0x1b9] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_B },
                     .operation = RL78_OPERATION_XCH },

        // 0x1c0-0x1cf
        [0x1c0] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_B },
                    .operation = RL78_OPERATION_CMP },
        [0x1c2] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_C },
                    .operation = RL78_OPERATION_CMP },
        [0x1c3] = { { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BH },
        [0x1c4] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x0088 },
                    .operation = RL78_OPERATION_CALLT },
        [0x1c5] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x0098 },
                    .operation = RL78_OPERATION_CALLT },
        [0x1c6] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x00A8 },
                    .operation = RL78_OPERATION_CALLT },
        [0x1c7] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x00B8 },
                    .operation = RL78_OPERATION_CALLT },
        [0x1c8] = { .operation = RL78_OPERATION_SKC },
        [0x1c9] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_B },
                     .operation = RL78_OPERATION_MOV },
        [0x1ca] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                     .operation = RL78_OPERATION_CALL },
        [0x1cb] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                     .operation = RL78_OPERATION_BR },
        [0x1cc] = { .operation = RL78_OPERATION_BRK },
        [0x1cd] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_SFR_PSW },
                     .operation = RL78_OPERATION_POP },
        [0x1ce] = { { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                     .operation = RL78_OPERATION_MOVS },
        [0x1cf] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_RB_RB0 },
                     .operation = RL78_OPERATION_SEL },

        // 0x1d0-0x1df
        [0x1d0] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_B },
                    .operation = RL78_OPERATION_AND },
        [0x1d2] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_C },
                    .operation = RL78_OPERATION_AND },
        [0x1d3] = { { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BNH },
        [0x1d4] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x008A },
                    .operation = RL78_OPERATION_CALLT },
        [0x1d5] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x009A },
                    .operation = RL78_OPERATION_CALLT },
        [0x1d6] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x00AA },
                    .operation = RL78_OPERATION_CALLT },
        [0x1d7] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x00BA },
                    .operation = RL78_OPERATION_CALLT },
        [0x1d8] = { .operation = RL78_OPERATION_SKNC },
        [0x1d9] = { { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                     .operation = RL78_OPERATION_MOV },
        [0x1da] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                     .operation = RL78_OPERATION_CALL },
        [0x1db] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 1 },
                     .operation = RL78_OPERATION_ROR },
        [0x1dc] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 1 },
                     .operation = RL78_OPERATION_ROLC },
        [0x1dd] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_SFR_PSW },
                     .operation = RL78_OPERATION_PUSH },
        [0x1de] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_X },
                    { .type = RL78_OP_TYPE_BASED_ADDR_8, .v0 = RL78_GPR_HL },
                     .operation = RL78_OPERATION_CMPS },
        [0x1df] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_RB_RB1 },
                     .operation = RL78_OPERATION_SEL },

