rizinorg/rizin/librz/asm/arch/rl78/rl78_maps.c
        // 0x1e0-0x1ef
        [0x1e0] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_B },
                    .operation = RL78_OPERATION_OR },
        [0x1e2] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_C },
                    .operation = RL78_OPERATION_OR },
        [0x1e3] = { .operation = RL78_OPERATION_SKH },
        [0x1e4] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x008C },
                    .operation = RL78_OPERATION_CALLT },
        [0x1e5] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x009C },
                    .operation = RL78_OPERATION_CALLT },
        [0x1e6] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x00AC },
                    .operation = RL78_OPERATION_CALLT },
        [0x1e7] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x00BC },
                    .operation = RL78_OPERATION_CALLT },
        [0x1e8] = { .operation = RL78_OPERATION_SKZ },
        [0x1e9] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_C },
                     .operation = RL78_OPERATION_MOV },
        [0x1ea] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_DE },
                     .operation = RL78_OPERATION_CALL },
        [0x1eb] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 1 },
                     .operation = RL78_OPERATION_ROL },
        [0x1ec] = { .operation = RL78_OPERATION_RETB },
        [0x1ed] = { .operation = RL78_OPERATION_HALT },
        [0x1ee] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 1 },
                     .operation = RL78_OPERATION_ROLWC },
        [0x1ef] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_RB_RB2 },
                     .operation = RL78_OPERATION_SEL },


        // 0x1f0-0x1ff
        [0x1f0] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_B },
                    .operation = RL78_OPERATION_XOR },
        [0x1f2] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_C },
                    .operation = RL78_OPERATION_XOR },
        [0x1f3] = { .operation = RL78_OPERATION_SKNH },
        [0x1f4] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x008E },
                    .operation = RL78_OPERATION_CALLT },
        [0x1f5] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x009E },
                    .operation = RL78_OPERATION_CALLT },
        [0x1f6] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x00AE },
                    .operation = RL78_OPERATION_CALLT },
        [0x1f7] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .v0 = 0x00BE },
                    .operation = RL78_OPERATION_CALLT },
        [0x1f8] = { .operation = RL78_OPERATION_SKNZ },
        [0x1f9] = { { .type = RL78_OP_TYPE_BASED_INDEX_ADDR, .v0 = RL78_GPR_HL, .v1 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                     .operation = RL78_OPERATION_MOV },
        [0x1fa] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_HL },
                     .operation = RL78_OPERATION_CALL },
        [0x1fb] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 1 },
                     .operation = RL78_OPERATION_RORC },
        [0x1fc] = { .operation = RL78_OPERATION_RETI },
        [0x1fd] = { .operation = RL78_OPERATION_STOP },
        [0x1fe] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 1 },
                     .operation = RL78_OPERATION_ROLWC },
        [0x1ff] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_RB_RB3 },
                     .operation = RL78_OPERATION_SEL },

        // map 2
        // 0x200-0x20f
        [0x200] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                     .operation = RL78_OPERATION_SET1 },
        [0x201] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x202] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    .operation = RL78_OPERATION_SET1 },
        [0x203] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x204] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x205] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    .operation = RL78_OPERATION_AND1 },
        [0x206] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    .operation = RL78_OPERATION_OR1 },
        [0x207] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    .operation = RL78_OPERATION_XOR1 },
        [0x208] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x209] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x20a] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    .operation = RL78_OPERATION_SET1 },
        [0x20b] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x20c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x20d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    .operation = RL78_OPERATION_AND1 },
        [0x20e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    .operation = RL78_OPERATION_OR1 },
        [0x20f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    .operation = RL78_OPERATION_XOR1 },

