rizinorg/rizin/librz/asm/arch/rl78/rl78_maps.c
        // 0x210-0x21f
        [0x210] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                     .operation = RL78_OPERATION_SET1 },
        [0x211] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x212] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    .operation = RL78_OPERATION_SET1 },
        [0x213] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x214] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x215] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    .operation = RL78_OPERATION_AND1 },
        [0x216] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    .operation = RL78_OPERATION_OR1 },
        [0x217] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    .operation = RL78_OPERATION_XOR1 },
        [0x218] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x219] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x21a] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    .operation = RL78_OPERATION_SET1 },
        [0x21b] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x21c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x21d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    .operation = RL78_OPERATION_AND1 },
        [0x21e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    .operation = RL78_OPERATION_OR1 },
        [0x21f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    .operation = RL78_OPERATION_XOR1 },

        // 0x220-0x22f
        [0x220] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                     .operation = RL78_OPERATION_SET1 },
        [0x221] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x222] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    .operation = RL78_OPERATION_SET1 },
        [0x223] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x224] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x225] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    .operation = RL78_OPERATION_AND1 },
        [0x226] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    .operation = RL78_OPERATION_OR1 },
        [0x227] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    .operation = RL78_OPERATION_XOR1 },
        [0x228] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x229] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x22a] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    .operation = RL78_OPERATION_SET1 },
        [0x22b] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x22c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x22d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    .operation = RL78_OPERATION_AND1 },
        [0x22e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    .operation = RL78_OPERATION_OR1 },
        [0x22f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    .operation = RL78_OPERATION_XOR1 },

        // 0x230-0x23f
        [0x230] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                     .operation = RL78_OPERATION_SET1 },
        [0x231] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x232] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    .operation = RL78_OPERATION_SET1 },
        [0x233] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x234] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x235] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    .operation = RL78_OPERATION_AND1 },
        [0x236] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    .operation = RL78_OPERATION_OR1 },
        [0x237] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    .operation = RL78_OPERATION_XOR1 },
        [0x238] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x239] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x23a] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    .operation = RL78_OPERATION_SET1 },
        [0x23b] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x23c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x23d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    .operation = RL78_OPERATION_AND1 },
        [0x23e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    .operation = RL78_OPERATION_OR1 },
        [0x23f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    .operation = RL78_OPERATION_XOR1 },

        // 0x240-0x24f
        [0x240] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                     .operation = RL78_OPERATION_SET1 },
        [0x241] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x242] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    .operation = RL78_OPERATION_SET1 },
        [0x243] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x244] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x245] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    .operation = RL78_OPERATION_AND1 },
        [0x246] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    .operation = RL78_OPERATION_OR1 },
        [0x247] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    .operation = RL78_OPERATION_XOR1 },
        [0x248] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x249] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x24a] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    .operation = RL78_OPERATION_SET1 },
        [0x24b] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x24c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x24d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    .operation = RL78_OPERATION_AND1 },
        [0x24e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    .operation = RL78_OPERATION_OR1 },
        [0x24f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    .operation = RL78_OPERATION_XOR1 },

        // 0x250-0x25f
        [0x250] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                     .operation = RL78_OPERATION_SET1 },
        [0x251] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x252] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    .operation = RL78_OPERATION_SET1 },
        [0x253] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x254] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x255] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    .operation = RL78_OPERATION_AND1 },
        [0x256] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    .operation = RL78_OPERATION_OR1 },
        [0x257] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    .operation = RL78_OPERATION_XOR1 },
        [0x258] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x259] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x25a] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    .operation = RL78_OPERATION_SET1 },
        [0x25b] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x25c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x25d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    .operation = RL78_OPERATION_AND1 },
        [0x25e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    .operation = RL78_OPERATION_OR1 },
        [0x25f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    .operation = RL78_OPERATION_XOR1 },

        // 0x260-0x26f
        [0x260] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                     .operation = RL78_OPERATION_SET1 },
        [0x261] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x262] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    .operation = RL78_OPERATION_SET1 },
        [0x263] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x264] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x265] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    .operation = RL78_OPERATION_AND1 },
        [0x266] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    .operation = RL78_OPERATION_OR1 },
        [0x267] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    .operation = RL78_OPERATION_XOR1 },
        [0x268] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x269] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x26a] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    .operation = RL78_OPERATION_SET1 },
        [0x26b] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x26c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x26d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    .operation = RL78_OPERATION_AND1 },
        [0x26e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    .operation = RL78_OPERATION_OR1 },
        [0x26f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    .operation = RL78_OPERATION_XOR1 },

        // 0x270-0x27f
        [0x270] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                     .operation = RL78_OPERATION_SET1 },
        [0x271] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x272] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    .operation = RL78_OPERATION_SET1 },
        [0x273] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x274] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x275] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    .operation = RL78_OPERATION_AND1 },
        [0x276] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    .operation = RL78_OPERATION_OR1 },
        [0x277] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    .operation = RL78_OPERATION_XOR1 },
        [0x278] = { { .type = RL78_OP_TYPE_ABSOLUTE_ADDR_16, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x279] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x27a] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    .operation = RL78_OPERATION_SET1 },
        [0x27b] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x27c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x27d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    .operation = RL78_OPERATION_AND1 },
        [0x27e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    .operation = RL78_OPERATION_OR1 },
        [0x27f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    .operation = RL78_OPERATION_XOR1 },

