rizinorg/rizin/librz/asm/arch/rl78/rl78_maps.c
        // 0x280-0x28f
        [0x280] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                     .operation = RL78_OPERATION_SET1 },
        [0x281] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 0 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x282] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 0 },
                    .operation = RL78_OPERATION_SET1 },
        [0x283] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 0 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x284] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 0 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x285] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 0 },
                    .operation = RL78_OPERATION_AND1 },
        [0x286] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 0 },
                    .operation = RL78_OPERATION_OR1 },
        [0x287] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 0 },
                    .operation = RL78_OPERATION_XOR1 },
        [0x288] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_CLR1 },
        [0x289] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 0 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x28a] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 0 },
                    .operation = RL78_OPERATION_SET1 },
        [0x28b] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 0 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x28c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 0 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x28d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 0 },
                    .operation = RL78_OPERATION_AND1 },
        [0x28e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 0 },
                    .operation = RL78_OPERATION_OR1 },
        [0x28f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 0 },
                    .operation = RL78_OPERATION_XOR1 },

        // 0x280-0x28f
        [0x291] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 1 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x292] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 1 },
                    .operation = RL78_OPERATION_SET1 },
        [0x293] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 1 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x294] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 1 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x295] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 1 },
                    .operation = RL78_OPERATION_AND1 },
        [0x296] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 1 },
                    .operation = RL78_OPERATION_OR1 },
        [0x297] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 1 },
                    .operation = RL78_OPERATION_XOR1 },
        [0x299] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 1 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x29a] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 1 },
                    .operation = RL78_OPERATION_SET1 },
        [0x29b] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 1 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x29c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 1 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x29d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 1 },
                    .operation = RL78_OPERATION_AND1 },
        [0x29e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 1 },
                    .operation = RL78_OPERATION_OR1 },
        [0x29f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 1 },
                    .operation = RL78_OPERATION_XOR1 },

        // 0x280-0x28f
        [0x2a1] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 2 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2a2] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 2 },
                    .operation = RL78_OPERATION_SET1 },
        [0x2a3] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 2 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x2a4] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 2 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2a5] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 2 },
                    .operation = RL78_OPERATION_AND1 },
        [0x2a6] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 2 },
                    .operation = RL78_OPERATION_OR1 },
        [0x2a7] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 2 },
                    .operation = RL78_OPERATION_XOR1 },
        [0x2a9] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 2 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2aa] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 2 },
                    .operation = RL78_OPERATION_SET1 },
        [0x2ab] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 2 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x2ac] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 2 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2ad] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 2 },
                    .operation = RL78_OPERATION_AND1 },
        [0x2ae] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 2 },
                    .operation = RL78_OPERATION_OR1 },
        [0x2af] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 2 },
                    .operation = RL78_OPERATION_XOR1 },

        // 0x280-0x28f
        [0x2b1] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 3 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2b2] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 3 },
                    .operation = RL78_OPERATION_SET1 },
        [0x2b3] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 3 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x2b4] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 3 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2b5] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 3 },
                    .operation = RL78_OPERATION_AND1 },
        [0x2b6] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 3 },
                    .operation = RL78_OPERATION_OR1 },
        [0x2b7] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 3 },
                    .operation = RL78_OPERATION_XOR1 },
        [0x2b9] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 3 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2ba] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 3 },
                    .operation = RL78_OPERATION_SET1 },
        [0x2bb] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 3 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x2bc] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 3 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2bd] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 3 },
                    .operation = RL78_OPERATION_AND1 },
        [0x2be] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 3 },
                    .operation = RL78_OPERATION_OR1 },
        [0x2bf] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 3 },
                    .operation = RL78_OPERATION_XOR1 },

        // 0x280-0x28f
        [0x2c0] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                     .operation = RL78_OPERATION_NOT1 },
        [0x2c1] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 4 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2c2] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 4 },
                    .operation = RL78_OPERATION_SET1 },
        [0x2c3] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 4 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x2c4] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 4 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2c5] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 4 },
                    .operation = RL78_OPERATION_AND1 },
        [0x2c6] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 4 },
                    .operation = RL78_OPERATION_OR1 },
        [0x2c7] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 4 },
                    .operation = RL78_OPERATION_XOR1 },
        [0x2c9] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 4 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2ca] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 4 },
                    .operation = RL78_OPERATION_SET1 },
        [0x2cb] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 4 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x2cc] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 4 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2cd] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 4 },
                    .operation = RL78_OPERATION_AND1 },
        [0x2ce] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 4 },
                    .operation = RL78_OPERATION_OR1 },
        [0x2cf] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 4 },
                    .operation = RL78_OPERATION_XOR1 },

        // 0x280-0x28f
        [0x2d1] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 5 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2d2] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 5 },
                    .operation = RL78_OPERATION_SET1 },
        [0x2d3] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 5 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x2d4] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 5 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2d5] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 5 },
                    .operation = RL78_OPERATION_AND1 },
        [0x2d6] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 5 },
                    .operation = RL78_OPERATION_OR1 },
        [0x2d7] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 5 },
                    .operation = RL78_OPERATION_XOR1 },
        [0x2d9] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 5 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2da] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 5 },
                    .operation = RL78_OPERATION_SET1 },
        [0x2db] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 5 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x2dc] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 5 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2dd] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 5 },
                    .operation = RL78_OPERATION_AND1 },
        [0x2de] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 5 },
                    .operation = RL78_OPERATION_OR1 },
        [0x2df] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 5 },
                    .operation = RL78_OPERATION_XOR1 },

        // 0x280-0x28f
        [0x2e1] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 6 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2e2] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 6 },
                    .operation = RL78_OPERATION_SET1 },
        [0x2e3] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 6 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x2e4] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 6 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2e5] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 6 },
                    .operation = RL78_OPERATION_AND1 },
        [0x2e6] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 6 },
                    .operation = RL78_OPERATION_OR1 },
        [0x2e7] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 6 },
                    .operation = RL78_OPERATION_XOR1 },
        [0x2e9] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 6 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2ea] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 6 },
                    .operation = RL78_OPERATION_SET1 },
        [0x2eb] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 6 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x2ec] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 6 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2ed] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 6 },
                    .operation = RL78_OPERATION_AND1 },
        [0x2ee] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 6 },
                    .operation = RL78_OPERATION_OR1 },
        [0x2ef] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 6 },
                    .operation = RL78_OPERATION_XOR1 },

