rizinorg/rizin/librz/asm/arch/rl78/rl78_maps.c
        // 0x280-0x28f
        [0x2f1] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 7 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2f2] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 7 },
                    .operation = RL78_OPERATION_SET1 },
        [0x2f3] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 7 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x2f4] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 7 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2f5] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 7 },
                    .operation = RL78_OPERATION_AND1 },
        [0x2f6] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 7 },
                    .operation = RL78_OPERATION_OR1 },
        [0x2f7] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 7 },
                    .operation = RL78_OPERATION_XOR1 },
        [0x2f9] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 7 },
                    { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2fa] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 7 },
                    .operation = RL78_OPERATION_SET1 },
        [0x2fb] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 7 },
                    .operation = RL78_OPERATION_CLR1 },
        [0x2fc] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 7 },
                    .operation = RL78_OPERATION_MOV1 },
        [0x2fd] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 7 },
                    .operation = RL78_OPERATION_AND1 },
        [0x2fe] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 7 },
                    .operation = RL78_OPERATION_OR1 },
        [0x2ff] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_PSW_CY },
                    { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 7 },
                    .operation = RL78_OPERATION_XOR1 },

        // 0x300-0x30f
        [0x300] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x301] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 0 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x302] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x303] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 0 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x304] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x305] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 0 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },

        // 0x310-0x31f
        [0x310] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x311] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 1 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x312] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x313] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 1 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x314] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x315] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 1 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x317] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 1 },
                    .operation = RL78_OPERATION_SHL },
        [0x318] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 1 },
                    .operation = RL78_OPERATION_SHL },
        [0x319] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 1 },
                    .operation = RL78_OPERATION_SHL },
        [0x31a] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 1 },
                    .operation = RL78_OPERATION_SHR },
        [0x31b] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 1 },
                    .operation = RL78_OPERATION_SAR },
        [0x31c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 1 },
                    .operation = RL78_OPERATION_SHLW },
        [0x31d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 1 },
                    .operation = RL78_OPERATION_SHLW },
        [0x31e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 1 },
                    .operation = RL78_OPERATION_SHRW },
        [0x31f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 1 },
                    .operation = RL78_OPERATION_SARW },

