rizinorg/rizin/librz/asm/arch/rl78/rl78_maps.c
        // 0x320-0x32f
        [0x320] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x321] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 2 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x322] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x323] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 2 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x324] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x325] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 2 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x327] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 2 },
                    .operation = RL78_OPERATION_SHL },
        [0x328] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 2 },
                    .operation = RL78_OPERATION_SHL },
        [0x329] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 2 },
                    .operation = RL78_OPERATION_SHL },
        [0x32a] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 2 },
                    .operation = RL78_OPERATION_SHR },
        [0x32b] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 2 },
                    .operation = RL78_OPERATION_SAR },
        [0x32c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 2 },
                    .operation = RL78_OPERATION_SHLW },
        [0x32d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 2 },
                    .operation = RL78_OPERATION_SHLW },
        [0x32e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 2 },
                    .operation = RL78_OPERATION_SHRW },
        [0x32f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 2 },
                    .operation = RL78_OPERATION_SARW },

        // 0x330-0x33f
        [0x330] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x331] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 3 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x332] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x333] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 3 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x334] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x335] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 3 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x337] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 3 },
                    .operation = RL78_OPERATION_SHL },
        [0x338] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 3 },
                    .operation = RL78_OPERATION_SHL },
        [0x339] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 3 },
                    .operation = RL78_OPERATION_SHL },
        [0x33a] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 3 },
                    .operation = RL78_OPERATION_SHR },
        [0x33b] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 3 },
                    .operation = RL78_OPERATION_SAR },
        [0x33c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 3 },
                    .operation = RL78_OPERATION_SHLW },
        [0x33d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 3 },
                    .operation = RL78_OPERATION_SHLW },
        [0x33e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 3 },
                    .operation = RL78_OPERATION_SHRW },
        [0x33f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 3 },
                    .operation = RL78_OPERATION_SARW },

        // 0x340-0x34f
        [0x340] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x341] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 4 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x342] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x343] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 4 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x344] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x345] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 4 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x347] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 4 },
                    .operation = RL78_OPERATION_SHL },
        [0x348] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 4 },
                    .operation = RL78_OPERATION_SHL },
        [0x349] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 4 },
                    .operation = RL78_OPERATION_SHL },
        [0x34a] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 4 },
                    .operation = RL78_OPERATION_SHR },
        [0x34b] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 4 },
                    .operation = RL78_OPERATION_SAR },
        [0x34c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 4 },
                    .operation = RL78_OPERATION_SHLW },
        [0x34d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 4 },
                    .operation = RL78_OPERATION_SHLW },
        [0x34e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 4 },
                    .operation = RL78_OPERATION_SHRW },
        [0x34f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 4 },
                    .operation = RL78_OPERATION_SARW },

        // 0x350-0x35f
        [0x350] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x351] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 5 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x352] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x353] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 5 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x354] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x355] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 5 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x357] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 5 },
                    .operation = RL78_OPERATION_SHL },
        [0x358] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 5 },
                    .operation = RL78_OPERATION_SHL },
        [0x359] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 5 },
                    .operation = RL78_OPERATION_SHL },
        [0x35a] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 5 },
                    .operation = RL78_OPERATION_SHR },
        [0x35b] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 5 },
                    .operation = RL78_OPERATION_SAR },
        [0x35c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 5 },
                    .operation = RL78_OPERATION_SHLW },
        [0x35d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 5 },
                    .operation = RL78_OPERATION_SHLW },
        [0x35e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 5 },
                    .operation = RL78_OPERATION_SHRW },
        [0x35f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 5 },
                    .operation = RL78_OPERATION_SARW },

        // 0x360-0x36f
        [0x360] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x361] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 6 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x362] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x363] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 6 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x364] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x365] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 6 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x367] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 6 },
                    .operation = RL78_OPERATION_SHL },
        [0x368] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 6 },
                    .operation = RL78_OPERATION_SHL },
        [0x369] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 6 },
                    .operation = RL78_OPERATION_SHL },
        [0x36a] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 6 },
                    .operation = RL78_OPERATION_SHR },
        [0x36b] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 6 },
                    .operation = RL78_OPERATION_SAR },
        [0x36c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 6 },
                    .operation = RL78_OPERATION_SHLW },
        [0x36d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 6 },
                    .operation = RL78_OPERATION_SHLW },
        [0x36e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 6 },
                    .operation = RL78_OPERATION_SHRW },
        [0x36f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 6 },
                    .operation = RL78_OPERATION_SARW },

        // 0x370-0x37f
        [0x370] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x371] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 7 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x372] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x373] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 7 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x374] = { { .type = RL78_OP_TYPE_SADDR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x375] = { { .type = RL78_OP_TYPE_SYMBOL, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_A, .v1 = 7 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x377] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_C },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 7 },
                    .operation = RL78_OPERATION_SHL },
        [0x378] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_B },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 7 },
                    .operation = RL78_OPERATION_SHL },
        [0x379] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 7 },
                    .operation = RL78_OPERATION_SHL },
        [0x37a] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 7 },
                    .operation = RL78_OPERATION_SHR },
        [0x37b] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_A },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 7 },
                    .operation = RL78_OPERATION_SAR },
        [0x37c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 7 },
                    .operation = RL78_OPERATION_SHLW },
        [0x37d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 7 },
                    .operation = RL78_OPERATION_SHLW },
        [0x37e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 7 },
                    .operation = RL78_OPERATION_SHRW },
        [0x37f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 7 },
                    .operation = RL78_OPERATION_SARW },

        // 0x380-0x38f
        [0x380] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x381] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 0 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x382] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x383] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 0 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x384] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 0 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x385] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 0 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x38c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 8 },
                    .operation = RL78_OPERATION_SHLW },
        [0x38d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 8 },
                    .operation = RL78_OPERATION_SHLW },
        [0x38e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 8 },
                    .operation = RL78_OPERATION_SHRW },
        [0x38f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 8 },
                    .operation = RL78_OPERATION_SARW },

        // 0x390-0x39f
        [0x390] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x391] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 1 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x392] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x393] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 1 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x394] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 1 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x395] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 1 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x39c] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 9 },
                    .operation = RL78_OPERATION_SHLW },
        [0x39d] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 9 },
                    .operation = RL78_OPERATION_SHLW },
        [0x39e] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 9 },
                    .operation = RL78_OPERATION_SHRW },
        [0x39f] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 9 },
                    .operation = RL78_OPERATION_SARW },

