rizinorg/rizin/librz/asm/arch/rl78/rl78_maps.c
        // 0x3a0-0x3af
        [0x3a0] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x3a1] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 2 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x3a2] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x3a3] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 2 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x3a4] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 2 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x3a5] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 2 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x3ac] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 10 },
                    .operation = RL78_OPERATION_SHLW },
        [0x3ad] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 10 },
                    .operation = RL78_OPERATION_SHLW },
        [0x3ae] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 10 },
                    .operation = RL78_OPERATION_SHRW },
        [0x3af] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 10 },
                    .operation = RL78_OPERATION_SARW },

        // 0x3b0-0x3bf
        [0x3b0] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x3b1] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 3 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x3b2] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x3b3] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 3 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x3b4] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 3 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x3b5] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 3 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x3bc] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 11 },
                    .operation = RL78_OPERATION_SHLW },
        [0x3bd] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 11 },
                    .operation = RL78_OPERATION_SHLW },
        [0x3be] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 11 },
                    .operation = RL78_OPERATION_SHRW },
        [0x3bf] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 11 },
                    .operation = RL78_OPERATION_SARW },

        // 0x3c0-0x3cf
        [0x3c0] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x3c1] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 4 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x3c2] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x3c3] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 4 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x3c4] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 4 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x3c5] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 4 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x3cc] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 12 },
                    .operation = RL78_OPERATION_SHLW },
        [0x3cd] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 12 },
                    .operation = RL78_OPERATION_SHLW },
        [0x3ce] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 12 },
                    .operation = RL78_OPERATION_SHRW },
        [0x3cf] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 12 },
                    .operation = RL78_OPERATION_SARW },

        // 0x3d0-0x3df
        [0x3d0] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x3d1] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 5 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x3d2] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x3d3] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 5 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x3d4] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 5 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x3d5] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 5 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x3dc] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 13 },
                    .operation = RL78_OPERATION_SHLW },
        [0x3dd] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 13 },
                    .operation = RL78_OPERATION_SHLW },
        [0x3de] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 13 },
                    .operation = RL78_OPERATION_SHRW },
        [0x3df] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 13 },
                    .operation = RL78_OPERATION_SARW },

