rizinorg/rizin/librz/asm/arch/rl78/rl78_maps.c
        // 0x3e0-0x3ef
        [0x3e0] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x3e1] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 6 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x3e2] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x3e3] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 6 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x3e4] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 6 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x3e5] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 6 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x3ec] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 14 },
                    .operation = RL78_OPERATION_SHLW },
        [0x3ed] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 14 },
                    .operation = RL78_OPERATION_SHLW },
        [0x3ee] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 14 },
                    .operation = RL78_OPERATION_SHRW },
        [0x3ef] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 14 },
                    .operation = RL78_OPERATION_SARW },

        // 0x3f0-0x3ff
        [0x3f0] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x3f1] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 7 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BTCLR },
        [0x3f2] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x3f3] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 7 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BT },
        [0x3f4] = { { .type = RL78_OP_TYPE_SFR, .flags = RL78_OP_FLAG_BA, .v1 = 7 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x3f5] = { { .type = RL78_OP_TYPE_INDIRECT_ADDR, .flags = RL78_OP_FLAG_BA, .v0 = RL78_GPR_HL, .v1 = 7 },
                    { .type = RL78_OP_TYPE_RELATIVE_ADDR_8 },
                    .operation = RL78_OPERATION_BF },
        [0x3fc] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_BC },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 15 },
                    .operation = RL78_OPERATION_SHLW },
        [0x3fd] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 15 },
                    .operation = RL78_OPERATION_SHLW },
        [0x3fe] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 15 },
                    .operation = RL78_OPERATION_SHRW },
        [0x3ff] = { { .type = RL78_OP_TYPE_SYMBOL, .v0 = RL78_GPR_AX },
                    { .type = RL78_OP_TYPE_DECIMAL, .v0 = 15 },
                    .operation = RL78_OPERATION_SARW },
};
